RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6750/hpm_csr_regs.h
/*
 * PMA2CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG0_PMA2CFG_MASK (0xFF0000UL)
#define CSR_PMACFG0_PMA2CFG_SHIFT (16U)
#define CSR_PMACFG0_PMA2CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG0_PMA2CFG_SHIFT) & CSR_PMACFG0_PMA2CFG_MASK)
#define CSR_PMACFG0_PMA2CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG0_PMA2CFG_MASK) >> CSR_PMACFG0_PMA2CFG_SHIFT)

/*
 * PMA1CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG0_PMA1CFG_MASK (0xFF00U)
#define CSR_PMACFG0_PMA1CFG_SHIFT (8U)
#define CSR_PMACFG0_PMA1CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG0_PMA1CFG_SHIFT) & CSR_PMACFG0_PMA1CFG_MASK)
#define CSR_PMACFG0_PMA1CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG0_PMA1CFG_MASK) >> CSR_PMACFG0_PMA1CFG_SHIFT)

/*
 * PMA0CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG0_PMA0CFG_MASK (0xFFU)
#define CSR_PMACFG0_PMA0CFG_SHIFT (0U)
#define CSR_PMACFG0_PMA0CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG0_PMA0CFG_SHIFT) & CSR_PMACFG0_PMA0CFG_MASK)
#define CSR_PMACFG0_PMA0CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG0_PMA0CFG_MASK) >> CSR_PMACFG0_PMA0CFG_SHIFT)

/* Bitfield definition for register: PMACFG1 */
/*
 * PMA7CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG1_PMA7CFG_MASK (0xFF000000UL)
#define CSR_PMACFG1_PMA7CFG_SHIFT (24U)
#define CSR_PMACFG1_PMA7CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG1_PMA7CFG_SHIFT) & CSR_PMACFG1_PMA7CFG_MASK)
#define CSR_PMACFG1_PMA7CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG1_PMA7CFG_MASK) >> CSR_PMACFG1_PMA7CFG_SHIFT)

/*
 * PMA6CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG1_PMA6CFG_MASK (0xFF0000UL)
#define CSR_PMACFG1_PMA6CFG_SHIFT (16U)
#define CSR_PMACFG1_PMA6CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG1_PMA6CFG_SHIFT) & CSR_PMACFG1_PMA6CFG_MASK)
#define CSR_PMACFG1_PMA6CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG1_PMA6CFG_MASK) >> CSR_PMACFG1_PMA6CFG_SHIFT)

/*
 * PMA5CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG1_PMA5CFG_MASK (0xFF00U)
#define CSR_PMACFG1_PMA5CFG_SHIFT (8U)
#define CSR_PMACFG1_PMA5CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG1_PMA5CFG_SHIFT) & CSR_PMACFG1_PMA5CFG_MASK)
#define CSR_PMACFG1_PMA5CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG1_PMA5CFG_MASK) >> CSR_PMACFG1_PMA5CFG_SHIFT)

/*
 * PMA4CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG1_PMA4CFG_MASK (0xFFU)
#define CSR_PMACFG1_PMA4CFG_SHIFT (0U)
#define CSR_PMACFG1_PMA4CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG1_PMA4CFG_SHIFT) & CSR_PMACFG1_PMA4CFG_MASK)
#define CSR_PMACFG1_PMA4CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG1_PMA4CFG_MASK) >> CSR_PMACFG1_PMA4CFG_SHIFT)

/* Bitfield definition for register: PMACFG2 */
/*
 * PMA11CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG2_PMA11CFG_MASK (0xFF000000UL)
#define CSR_PMACFG2_PMA11CFG_SHIFT (24U)
#define CSR_PMACFG2_PMA11CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG2_PMA11CFG_SHIFT) & CSR_PMACFG2_PMA11CFG_MASK)
#define CSR_PMACFG2_PMA11CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG2_PMA11CFG_MASK) >> CSR_PMACFG2_PMA11CFG_SHIFT)

/*
 * PMA10CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG2_PMA10CFG_MASK (0xFF0000UL)
#define CSR_PMACFG2_PMA10CFG_SHIFT (16U)
#define CSR_PMACFG2_PMA10CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG2_PMA10CFG_SHIFT) & CSR_PMACFG2_PMA10CFG_MASK)
#define CSR_PMACFG2_PMA10CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG2_PMA10CFG_MASK) >> CSR_PMACFG2_PMA10CFG_SHIFT)

/*
 * PMA9CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG2_PMA9CFG_MASK (0xFF00U)
#define CSR_PMACFG2_PMA9CFG_SHIFT (8U)
#define CSR_PMACFG2_PMA9CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG2_PMA9CFG_SHIFT) & CSR_PMACFG2_PMA9CFG_MASK)
#define CSR_PMACFG2_PMA9CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG2_PMA9CFG_MASK) >> CSR_PMACFG2_PMA9CFG_SHIFT)

/*
 * PMA8CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG2_PMA8CFG_MASK (0xFFU)
#define CSR_PMACFG2_PMA8CFG_SHIFT (0U)
#define CSR_PMACFG2_PMA8CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG2_PMA8CFG_SHIFT) & CSR_PMACFG2_PMA8CFG_MASK)
#define CSR_PMACFG2_PMA8CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG2_PMA8CFG_MASK) >> CSR_PMACFG2_PMA8CFG_SHIFT)

/* Bitfield definition for register: PMACFG3 */
/*
 * PMA15CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG3_PMA15CFG_MASK (0xFF000000UL)
#define CSR_PMACFG3_PMA15CFG_SHIFT (24U)
#define CSR_PMACFG3_PMA15CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG3_PMA15CFG_SHIFT) & CSR_PMACFG3_PMA15CFG_MASK)
#define CSR_PMACFG3_PMA15CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG3_PMA15CFG_MASK) >> CSR_PMACFG3_PMA15CFG_SHIFT)

/*
 * PMA14CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG3_PMA14CFG_MASK (0xFF0000UL)
#define CSR_PMACFG3_PMA14CFG_SHIFT (16U)
#define CSR_PMACFG3_PMA14CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG3_PMA14CFG_SHIFT) & CSR_PMACFG3_PMA14CFG_MASK)
#define CSR_PMACFG3_PMA14CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG3_PMA14CFG_MASK) >> CSR_PMACFG3_PMA14CFG_SHIFT)

/*
 * PMA13CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG3_PMA13CFG_MASK (0xFF00U)
#define CSR_PMACFG3_PMA13CFG_SHIFT (8U)
#define CSR_PMACFG3_PMA13CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG3_PMA13CFG_SHIFT) & CSR_PMACFG3_PMA13CFG_MASK)
#define CSR_PMACFG3_PMA13CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG3_PMA13CFG_MASK) >> CSR_PMACFG3_PMA13CFG_SHIFT)

/*
 * PMA12CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG3_PMA12CFG_MASK (0xFFU)
#define CSR_PMACFG3_PMA12CFG_SHIFT (0U)
#define CSR_PMACFG3_PMA12CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG3_PMA12CFG_SHIFT) & CSR_PMACFG3_PMA12CFG_MASK)
#define CSR_PMACFG3_PMA12CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG3_PMA12CFG_MASK) >> CSR_PMACFG3_PMA12CFG_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * Register Content     :     Match Size(Byte)
 * aaaa. . . aaaaaaaaaaa       Reserved
 * . . . . . .
 * aaaa. . . aa011111111      Reserved
 * aaaa. . . a0111111111      2^{12}
 * aaaa. . . 01111111111      2^{13}
 * . . . . . .
 * aa01. . . 11111111111      2^{XLEN}
 * a011. . . 11111111111      2^{XLEN+1}
 * 0111. . . 11111111111      2^{XLEN+2}
 * 1111. . . 11111111111      Reserved
 */
#define CSR_PMAADDR0_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR0_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR0_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR0_PMAADDR_31_2_SHIFT) & CSR_PMAADDR0_PMAADDR_31_2_MASK)
#define CSR_PMAADDR0_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR0_PMAADDR_31_2_MASK) >> CSR_PMAADDR0_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR1_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR1_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR1_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR1_PMAADDR_31_2_SHIFT) & CSR_PMAADDR1_PMAADDR_31_2_MASK)
#define CSR_PMAADDR1_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR1_PMAADDR_31_2_MASK) >> CSR_PMAADDR1_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR2_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR2_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR2_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR2_PMAADDR_31_2_SHIFT) & CSR_PMAADDR2_PMAADDR_31_2_MASK)
#define CSR_PMAADDR2_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR2_PMAADDR_31_2_MASK) >> CSR_PMAADDR2_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR3_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR3_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR3_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR3_PMAADDR_31_2_SHIFT) & CSR_PMAADDR3_PMAADDR_31_2_MASK)
#define CSR_PMAADDR3_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR3_PMAADDR_31_2_MASK) >> CSR_PMAADDR3_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR4_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR4_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR4_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR4_PMAADDR_31_2_SHIFT) & CSR_PMAADDR4_PMAADDR_31_2_MASK)
#define CSR_PMAADDR4_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR4_PMAADDR_31_2_MASK) >> CSR_PMAADDR4_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR5_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR5_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR5_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR5_PMAADDR_31_2_SHIFT) & CSR_PMAADDR5_PMAADDR_31_2_MASK)
#define CSR_PMAADDR5_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR5_PMAADDR_31_2_MASK) >> CSR_PMAADDR5_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR6_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR6_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR6_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR6_PMAADDR_31_2_SHIFT) & CSR_PMAADDR6_PMAADDR_31_2_MASK)
#define CSR_PMAADDR6_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR6_PMAADDR_31_2_MASK) >> CSR_PMAADDR6_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR7_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR7_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR7_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR7_PMAADDR_31_2_SHIFT) & CSR_PMAADDR7_PMAADDR_31_2_MASK)
#define CSR_PMAADDR7_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR7_PMAADDR_31_2_MASK) >> CSR_PMAADDR7_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR8_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR8_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR8_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR8_PMAADDR_31_2_SHIFT) & CSR_PMAADDR8_PMAADDR_31_2_MASK)
#define CSR_PMAADDR8_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR8_PMAADDR_31_2_MASK) >> CSR_PMAADDR8_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR9_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR9_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR9_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR9_PMAADDR_31_2_SHIFT) & CSR_PMAADDR9_PMAADDR_31_2_MASK)
#define CSR_PMAADDR9_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR9_PMAADDR_31_2_MASK) >> CSR_PMAADDR9_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR10_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR10_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR10_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR10_PMAADDR_31_2_SHIFT) & CSR_PMAADDR10_PMAADDR_31_2_MASK)
#define CSR_PMAADDR10_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR10_PMAADDR_31_2_MASK) >> CSR_PMAADDR10_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR11_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR11_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR11_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR11_PMAADDR_31_2_SHIFT) & CSR_PMAADDR11_PMAADDR_31_2_MASK)
#define CSR_PMAADDR11_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR11_PMAADDR_31_2_MASK) >> CSR_PMAADDR11_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR12_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR12_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR12_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR12_PMAADDR_31_2_SHIFT) & CSR_PMAADDR12_PMAADDR_31_2_MASK)
#define CSR_PMAADDR12_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR12_PMAADDR_31_2_MASK) >> CSR_PMAADDR12_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR13_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR13_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR13_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR13_PMAADDR_31_2_SHIFT) & CSR_PMAADDR13_PMAADDR_31_2_MASK)
#define CSR_PMAADDR13_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR13_PMAADDR_31_2_MASK) >> CSR_PMAADDR13_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR14_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR14_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR14_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR14_PMAADDR_31_2_SHIFT) & CSR_PMAADDR14_PMAADDR_31_2_MASK)
#define CSR_PMAADDR14_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR14_PMAADDR_31_2_MASK) >> CSR_PMAADDR14_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMAADDR */
/*
 * PMAADDR_31_2 (RW)
 *
 * same as PMAADDR0
 */
#define CSR_PMAADDR15_PMAADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMAADDR15_PMAADDR_31_2_SHIFT (2U)
#define CSR_PMAADDR15_PMAADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMAADDR15_PMAADDR_31_2_SHIFT) & CSR_PMAADDR15_PMAADDR_31_2_MASK)
#define CSR_PMAADDR15_PMAADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMAADDR15_PMAADDR_31_2_MASK) >> CSR_PMAADDR15_PMAADDR_31_2_SHIFT)

/* Bitfield definition for register: CYCLE */
/*
 * CYCLE (RW)
 *
 * Cycle Counter
 */
#define CSR_CYCLE_CYCLE_MASK (0xFFFFFFFFUL)
#define CSR_CYCLE_CYCLE_SHIFT (0U)
#define CSR_CYCLE_CYCLE_SET(x) (((uint32_t)(x) << CSR_CYCLE_CYCLE_SHIFT) & CSR_CYCLE_CYCLE_MASK)
#define CSR_CYCLE_CYCLE_GET(x) (((uint32_t)(x) & CSR_CYCLE_CYCLE_MASK) >> CSR_CYCLE_CYCLE_SHIFT)

/* Bitfield definition for register: CYCLEH */
/*
 * CYCLEH (RW)
 *
 * Cycle Counter Higher 32-bit
 */
#define CSR_CYCLEH_CYCLEH_MASK (0xFFFFFFFFUL)
#define CSR_CYCLEH_CYCLEH_SHIFT (0U)
#define CSR_CYCLEH_CYCLEH_SET(x) (((uint32_t)(x) << CSR_CYCLEH_CYCLEH_SHIFT) & CSR_CYCLEH_CYCLEH_MASK)
#define CSR_CYCLEH_CYCLEH_GET(x) (((uint32_t)(x) & CSR_CYCLEH_CYCLEH_MASK) >> CSR_CYCLEH_CYCLEH_SHIFT)

/* Bitfield definition for register: MVENDORID */
/*
 * MVENDORID (RO)
 *
 * The manufacturer ID
 */
#define CSR_MVENDORID_MVENDORID_MASK (0xFFFFFFFFUL)
#define CSR_MVENDORID_MVENDORID_SHIFT (0U)
#define CSR_MVENDORID_MVENDORID_GET(x) (((uint32_t)(x) & CSR_MVENDORID_MVENDORID_MASK) >> CSR_MVENDORID_MVENDORID_SHIFT)

/* Bitfield definition for register: MARCHID */
/*
 * CPU_ID (RO)
 *
 * CPU ID
 */
#define CSR_MARCHID_CPU_ID_MASK (0x7FFFFFFFUL)
#define CSR_MARCHID_CPU_ID_SHIFT (0U)
#define CSR_MARCHID_CPU_ID_GET(x) (((uint32_t)(x) & CSR_MARCHID_CPU_ID_MASK) >> CSR_MARCHID_CPU_ID_SHIFT)

